#3.01
#Ввести с клавиатуры имя пользователя.
#Вывести на экран “Hello, [name]!"
def name():
	name = input("Введите имя: ")
	print(f"Hello, {name} !")

name()