
def nominal(b,m):
	f = int(b)
	t = int(m)
	if f//10!=0:
		kup_10=f//10
		kup_5=(f-(kup_10*10))//5
		kop=((f-(kup_10*10)-(kup_5*5))*100+t)
		kop_50=kop//50
		kop_20=(kop-(kop_50*50))//20
		kop_1=kop-(kop_50*50)-(kop_20*20)
		print(f"К выдаче купюры: номинал 10р. - {kup_10} шт., номинал 5р. -  {kup_5} шт.; К выдаче копейки : номинал 50коп. - {kop_50} шт.,номинал 20коп. - {kop_20} шт.,номинал 1коп. - {kop_1} шт.")
	elif f>=5 and f<10:
		kup_5=f//5 
		kop=((f-(kup_5*5))*100+t)
		kop_50=kop//50
		kop_20=(kop-(kop_50*50))//20
		kop_1=kop-(kop_50*50)-(kop_20*20)
		print(f"К выдаче купюры: номинал 5р. -  {kup_5} шт.; К выдаче копейки : номинал 50коп. - {kop_50} шт.,номинал 20коп. - {kop_20} шт.,номинал 1коп. - {kop_1} шт.")
	else:
		kop=f*100+t
		kop_50=kop//50
		kop_20=(kop-(kop_50*50))//20
		kop_1=kop-(kop_50*50)-(kop_20*20)
		print(f"К выдаче копейки : номинал 50коп. - {kop_50} шт.,номинал 20коп. - {kop_20} шт.,номинал 1коп. - {kop_1} шт.")


def main():
	money = input('Введите через точку число: ').split('.')
	b = money[0]
	m = money[1]
	print(f"{b} рублей {m} копеек")
	nominal(b,m)

main()



